# DirectoryNotEmptyException Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectoryNotEmptyException Class
Members See Also
---
The exception that is thrown when a method received a directory as an argument and requires that the directory be empty but the directory is not empty.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
[SerializableAttribute]
public class DirectoryNotEmptyException : ArgumentException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class DirectoryNotEmptyException _
	Inherits ArgumentException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class DirectoryNotEmptyException : public ArgumentException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..ArgumentException Autodesk.Revit.Exceptions..::..DirectoryNotEmptyException
# See Also
DirectoryNotEmptyException Members
Autodesk.Revit.Exceptions Namespace